In [27]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [28]:
lst = [1,2,3] 
s = pd.Series(lst, index=['Razan', 'Asma', 'Noura' ])
s

Razan    1
Asma     2
Noura    3
dtype: int64

## Q2: Change indexes to 11, 12, 13.

In [29]:
s.index = [11,12,13]
s

11    1
12    2
13    3
dtype: int64

## Q3: Retrieve First and second elements.

In [30]:
s[:2]

11    1
12    2
dtype: int64

## Q4: Add duplicate elements, then remove the duplication

In [31]:
ls2 = [1,2,3]
s1 = pd.Series(ls2, index=['11', '12', '13' ])
df = pd.concat([s, s1])
df

11    1
12    2
13    3
11    1
12    2
13    3
dtype: int64

In [32]:
df.drop_duplicates()

11    1
12    2
13    3
dtype: int64

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [38]:
data = {'ID': [439002791, 439002345, 439002691],
      'Name': ['Razan', 'Sara', 'Lama'],
     'Grade':['A','B','C']}

std = pd.DataFrame(data, columns=['ID', 'Name', 'Grade'])
std

          ID   Name Grade
0  439002791  Razan     A
1  439002345   Sara     B
2  439002691   Lama     C

## Q6: Read educ_figdp_1_Data.csv file

In [39]:
edu = pd.read_csv('C:/Users/96656/Documents/GitHub/Day7-Lab1-Pandas/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references